RobWilks/nrf51_ADXL345/bikeVibe.c
/**
 * Copyright (c) 2015 - 2017, Nordic Semiconductor ASA
 * 
 * All rights reserved.
 * 
 * Redistribution and use in source and binary forms, with or without modification,
 * are permitted provided that the following conditions are met:
 * 
 * 1. Redistributions of source code must retain the above copyright notice, this
 *    list of conditions and the following disclaimer.
 * 
 * 2. Redistributions in binary form, except as embedded into a Nordic
 *    Semiconductor ASA integrated circuit in a product or a software update for
 *    such product, must reproduce the above copyright notice, this list of
 *    conditions and the following disclaimer in the documentation and/or other
 *    materials provided with the distribution.
 * 
 * 3. Neither the name of Nordic Semiconductor ASA nor the names of its
 *    contributors may be used to endorse or promote products derived from this
 *    software without specific prior written permission.
 * 
 * 4. This software, with or without modification, must only be used with a
 *    Nordic Semiconductor ASA integrated circuit.
 * 
 * 5. Any software provided in binary form under this license must not be reverse
 *    engineered, decompiled, modified and/or disassembled.
 * 
 * THIS SOFTWARE IS PROVIDED BY NORDIC SEMICONDUCTOR ASA "AS IS" AND ANY EXPRESS
 * OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
 * OF MERCHANTABILITY, NONINFRINGEMENT, AND FITNESS FOR A PARTICULAR PURPOSE ARE
 * DISCLAIMED. IN NO EVENT SHALL NORDIC SEMICONDUCTOR ASA OR CONTRIBUTORS BE
 * LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
 * CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE
 * GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
 * HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
 * LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT
 * OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 * 
 */

/** @file
 * @defgroup nrf_twi_master_example main.c
 * @{
 * @ingroup nrf_twi_example
 * @brief TWI Example Application main file.
 *
 * This file contains the source code for a sample application using TWI.
 */

#include "ADXL345.h"
#include "app_error.h"
#include "app_timer.h"
#include "app_twi.h"
#include "app_uart.h"
#include "app_util_platform.h"
#include "boards.h"
#include "bsp.h"
#include "compiler_abstraction.h"
#include "diskio_blkdev.h"
#include "ff.h"
#include "lm75b.h"
#include "mma7660.h"
#include "nrf.h"
#include "nrf_block_dev_sdc.h"
#include "nrf_delay.h"
#include "nrf_drv_clock.h"
#include "nrf_drv_rtc.h"
#include <stdbool.h>
#include <stdint.h>
#include <stdio.h>
#define NRF_LOG_MODULE_NAME "APP"
#include "nrf_log.h"
#include "nrf_log_ctrl.h"
#include <__vfprintf.h> //rjw
#include <stdarg.h>     //rjw
#include <stdio.h>      //rjw

#define DEBUG 0

#define MAX_PENDING_TRANSACTIONS 5

#define APP_TIMER_PRESCALER 0
#define APP_TIMER_OP_QUEUE_SIZE 2

#define MAX_TEST_DATA_BYTES (15U) /**< max number of test bytes to be used for tx and rx. */
#define UART_TX_BUF_SIZE 256      /**< UART TX buffer size. */
#define UART_RX_BUF_SIZE 256      /**< UART RX buffer size. */
#define DATA_BUFFER_SIZE 252      /**< data buffer for high frequency measurement. */

// added for SPI comms
#define FILE_NAME "ADXL_DAT.TXT"
#define TEST_STRING "SD card example.\r\n"

//mod for BLE400
#define SDC_SCK_PIN SPIM0_SCK_PIN   ///< SDC serial clock (SCK) pin.
#define SDC_MOSI_PIN SPIM0_MOSI_PIN ///< SDC serial data in (DI) pin.
#define SDC_MISO_PIN SPIM0_MISO_PIN ///< SDC serial data out (DO) pin.
#define SDC_CS_PIN SPIM0_SS_PIN     ///< SDC chip select (CS) pin.

//configure accelerometer data capture
#define SIZE_FFT 0x1000                //no of datapoints for each measurement; power of 2
#define TIME_TO_NEXT_MEASUREMENT 30000 //in millisec
#define NO_FILES 5                     //total number to measure in this sequence

//configure rtc timer
#define TICK_FREQUENCY 1024 //approx 1kHz
volatile bool tick = false;
volatile uint32_t millis = 0;

char filename[] = "adxl0000.DAT";

/**
 * @brief  SDC block device definition
 * */
NRF_BLOCK_DEV_SDC_DEFINE(
    m_block_dev_sdc,
    NRF_BLOCK_DEV_SDC_CONFIG(
        SDC_SECTOR_SIZE,
        APP_SDCARD_CONFIG(SDC_MOSI_PIN, SDC_MISO_PIN, SDC_SCK_PIN, SDC_CS_PIN)),
    NFR_BLOCK_DEV_INFO_CONFIG("Nordic", "SDC", "1.00"));

char data[50] = {0}; /* Line buffer */
// end of SPI / SDC

static app_twi_t m_app_twi = APP_TWI_INSTANCE(0);

bool got_callback;
bool button0_pressed = false;
bool button1_pressed = false;

extern int16_t xyz_int[3];
extern double xyz[3];

// Buffer for data read from sensors.
#define BUFFER_SIZE 11
uint8_t m_buffer[BUFFER_SIZE];

// Buffer for high frequency accelerometer data
uint8_t data_buffer[DATA_BUFFER_SIZE];

// Data structures needed for averaging of data read from sensors.
// [max 32, otherwise "int16_t" won't be sufficient to hold the sum
//  of temperature samples]
#define NUMBER_OF_SAMPLES 16
#define CALIBRATE 0
typedef struct
{
  int16_t temp;
  int16_t x;
  int16_t y;
  int16_t z;
} sum_t;

static sum_t m_sum = {0, 0, 0, 0};

typedef struct
{
  // [use bit fields to fit whole structure into one 32-bit word]
  int16_t temp : 11;
  int8_t x : 6;
  int8_t y : 6;
  int8_t z : 6;
} sample_t;

static sample_t m_samples[NUMBER_OF_SAMPLES] = {{0, 0, 0, 0}};

static uint8_t m_sample_idx = 0;

// Value previously read from MMA7660's Tilt register - used to detect change
// in orientation, shake signaling etc.
static uint8_t m_prev_tilt = 0;

#if defined(__GNUC__) && (__LINT__ == 0)
// This is required if one wants to use floating-point values in 'printf'
// (by default this feature is not linked together with newlib-nano).
// Please note, however, that this adds about 13 kB code footprint...
__ASM(".global _printf_float");
#endif

////////////////////////////////////////////////////////////////////////////////
// Reading of data from sensors - current temperature from LM75B and from
// MMA7660: X, Y, Z and tilt status.
#if (BUFFER_SIZE < 6)
#error Buffer too small.
#endif
#define GET_ACC_VALUE(axis, reg_data)      \
  do {                                     \
    if (MMA7660_DATA_IS_VALID(reg_data)) { \
      axis = MMA7660_GET_ACC(reg_data);    \
    }                                      \
  } while (0)
/*
void read_all_cb(ret_code_t result, void * p_user_data)
{
    if (result != NRF_SUCCESS)
    {
        uart_printf("read_all_cb - error: %d\r\n", (int)result);
        return;
    }

