RobWilks/nrf51_ADXL345/bikeVibe.c
    ff_result = f_write(&file, TEST_STRING, sizeof(TEST_STRING) - 1, (UINT *) &bytes_written);
    if (ff_result != FR_OK)
    {
        uart_printf("Write failed\r\n.");
    }
    else
    {
        uart_printf("%d bytes written.\r\n", bytes_written);
    }

    (void) f_close(&file);
*/

  /*
// addition

//read content of the file
ff_result = f_open(&file, FILE_NAME, FA_READ);
if (ff_result != FR_OK)
{
    uart_printf("Unable to open or create file: " FILE_NAME ".\r\n");
    return;
}

uint16_t size = f_size(&file);
uart_printf("size of the file in bytes = %d\r\n", size);

bytes_read = 0;

ff_result = f_read(&file, data, sizeof(data), (UINT *)&bytes_read);

if (ff_result != FR_OK) {
  uart_printf("Unable to read or create file: " FILE_NAME ".\r\n");
  return;
} else {
  uart_printf("%d bytes read\r\n", bytes_read);
}
(void) f_close(&file);
*/
  return;
}
////////////////////////////////////////////////////////////////////////////////

int main(void) {
  uint32_t err_code; // added for UART
  uint32_t bytes_written;
  FRESULT ff_result;
  static FIL dataFile;

  bsp_board_leds_init();

#if APP_UART_ENABLED
  // Initialise UART

  const app_uart_comm_params_t comm_params =
      {
          RX_PIN_NUMBER,
          TX_PIN_NUMBER,
          RTS_PIN_NUMBER,
          CTS_PIN_NUMBER,
          APP_UART_FLOW_CONTROL_ENABLED,
          false,
          UART_BAUDRATE_BAUDRATE_Baud115200};

  APP_UART_FIFO_INIT(&comm_params,
      UART_RX_BUF_SIZE,
      UART_TX_BUF_SIZE,
      uart_error_handle,
      APP_IRQ_PRIORITY_LOWEST,
      err_code);

  APP_ERROR_CHECK(err_code);
#endif // APP_UART_ENABLED

  // Start internal LFCLK XTAL oscillator - it is needed by BSP to handle
  // buttons with the use of APP_TIMER and for "read_all" ticks generation
  // (by RTC).
  lfclk_config();

#if CALIBRATE
  bsp_config();
#endif // CALIBRATE

  twi_config();

  //    initialisation of ADXL345

  APP_ERROR_CHECK(app_twi_perform(&m_app_twi, adxl345_init_transfers,
      ADXL345_INIT_TRANSFER_COUNT, NULL));

  //*************************** CONFIGURE ADXL345 **************************/
  set_range(8);
  setRegisterBit(ADXL345_INT_MAP, 6, 1);
  uart_printf("INT_map: bit6 = %d\n", getRegisterBit(ADXL345_INT_MAP, 6));

  setTapThreshold(50);     // 62.5 mg per increment
  setTapDuration(15);      // 625 µs per increment
  setDoubleTapLatency(80); // 1.25 ms per increment
  setDoubleTapWindow(200); // 1.25 ms per increment
  setRate(800);            // rate of update of data regs in Hz
  uart_printf("Double Tap Window = %d\n", getDoubleTapWindow());
  uart_printf("TapDuration = %d\n", getTapDuration());

  setActivityXYZ(0, 0, 0);  // Set to activate movement detection in the axes "setActivityXYZ(X, Y, Z);" (1 == ON, 0 == OFF)
  setActivityThreshold(75); // 62.5mg per increment   // Set activity   // Inactivity thresholds (0-255)

  setInactivityXYZ(0, 0, 0);  // Set to detect inactivity in all the axes "setInactivityXYZ(X, Y, Z);" (1 == ON, 0 == OFF)
  setInactivityThreshold(75); // 62.5mg per increment   // Set inactivity // Inactivity thresholds (0-255)
  setTimeInactivity(10);      // How many seconds of no activity is inactive?

  uart_printf("isActivityXEnabled = %d\n", isActivityXEnabled());
  uart_printf("isActivityYEnabled = %d\n", isActivityYEnabled());

  uart_printf("isInActivityXEnabled = %d\n", isInactivityXEnabled());

  uart_printf("\r\nFATFS example.\r\n\r\n");

  //*************************** CONFIGURE SD CARD **************************/
  fatfs_init();

  static uint8_t register_address;
  register_address = ADXL345_DATAX0;
  static app_twi_transfer_t const transfers[] =
      {
          ADXL345_READ(&register_address, m_buffer, 6)

      };
  static app_twi_transaction_t const transaction =
      {
          .callback = default_cb,
          .p_user_data = NULL,
          .p_transfers = transfers,
          .number_of_transfers = sizeof(transfers) / sizeof(transfers[0])};

  //*************************** find number of first file **************************/

  uint16_t j = 0;
  uint16_t firstFile = 0xffff;
  while ((j < NO_FILES) && (firstFile == 0xffff)) {
    uint16_t temp = j;
    for (uint8_t k = 0; k < 4; k++) {
      filename[7 - k] = temp % 10 + '0';
      temp /= 10;
    }

    ff_result = f_open(&dataFile, filename, FA_READ);
    if (ff_result == FR_NO_FILE) {
      uart_printf("First file: %i.\r\n", j);
      firstFile = j;
    } else {
      (void)f_close(&dataFile);
    }
    ++j;
  }
  if (firstFile == 0xffff) {
    uart_printf("All files written\r\n");
    while (true) {
    }
  }

  //*************************** start measurements **************************/

  flash_led(7); // indicate ready to start
  for (j = firstFile; j < firstFile + NO_FILES; j++) {
    uint16_t temp = j;
    for (uint8_t k = 0; k < 4; k++) {
      filename[7 - k] = temp % 10 + '0';
      temp /= 10;
    }

    ff_result = f_open(&dataFile, filename, FA_READ | FA_WRITE | FA_OPEN_APPEND);
    if (ff_result != FR_OK) {
      uart_printf("Unable to create file: %i.\r\n", j);
      flash_led(3);

      while (true) {
      };
    }
    uart_printf("Writing file: %i.\r\n", j);
#if CALIBRATE
    uint8_t nPositions = 0;
    while (!button1_pressed) {
      if (button0_pressed) {
        LEDS_INVERT(BSP_LED_0_MASK);
        for (uint8_t i = 0; i < 3; i++)
          xyz_int[i] = 0;
        uint32_t count = 0;

        while (count < NUMBER_OF_SAMPLES) {
          got_callback = false;
          APP_ERROR_CHECK(app_twi_schedule(&m_app_twi, &transaction));
          while (!got_callback) {
          }

          for (uint8_t i = 0; i < 3; i++) {
            xyz_int[i] += (((int)m_buffer[i * 2 + 1]) << 8) | m_buffer[i * 2];
          };

          ++count;
        }
        for (uint8_t i = 0; i < 3; i++) {
          m_buffer[i * 2] = xyz_int[i] & 0x00ff;
          m_buffer[i * 2 + 1] = xyz_int[i] >> 8;
          uart_printf("xyz[%i]: %i.\r\n", i, xyz_int[i]);
        };

        ff_result = f_write(&dataFile, m_buffer, 6, (UINT *)&bytes_written);

        LEDS_INVERT(BSP_LED_0_MASK);
        button0_pressed = false;
        ++nPositions;
      }
    }
    uart_printf("Calibrated on %i positions\n\r", nPositions);
    (void)f_close(&dataFile);
    LEDS_INVERT(BSP_LED_4_MASK);
    while (true) {
    }

#else

    LEDS_INVERT(BSP_LED_0_MASK);
    uint32_t count = 0;
    //*************************** CONFIGURE RTC **************************/
    rtc_config();
    while ((count < SIZE_FFT)) {
      while (!tick) {
      };
      tick = false;
      got_callback = false;
      APP_ERROR_CHECK(app_twi_schedule(&m_app_twi, &transaction));
      while (!got_callback) {
      }

      ff_result = f_write(&dataFile, m_buffer, 6, (UINT *)&bytes_written);

      ++count;
    }
    (void)f_close(&dataFile);
    LEDS_INVERT(BSP_LED_0_MASK);
    nrf_delay_ms(TIME_TO_NEXT_MEASUREMENT);
#endif // CALIBRATE
  }
  while (true) {
  }
}
/** @} */